//HTML (Hypertext Markup Language) - это код, который используется для структурирования и отображения веб-страницы и её контента.

/*Мета-теги — это необязательные атрибуты, размещенные в заголовке страницы, между тегами <head> и </head>.

Выделяется несколько основных направлений использования мета-тегов:

- мета-теги могут идентифицировать авторство веб-документа, его адрес, частоту его обновлений;
- мета-теги используются поисковыми роботами для индексации и создания заголовков гипертекстовых документов;
- мета-теги влияют на режим отображения веб-страниц.

Мета-теги можно разделить на две основные группы — это NAME и HTTP-EQUIV. Группа NAME (keywords, description, author, copyright, robots) отвечает за текстовую информацию
о веб-документе, его авторе, а также — формирует рекомендации для поисковых роботов. Мета-теги, относящиеся к группе HTTP-EQUIV (Content-Type, refresh, Content-Language),        
формируют заголовок веб-страницы и определяют его обработку, а также управляют действиями браузеров и используются для формирования информации, выдаваемой обычными заголовками.*/

/*Семантическая вёрстка — подход к разметке, который опирается не на содержание сайта, а на смысловое предназначение каждого блока и логическую структуру документа, что в        
свою очередь определяет доступность сайта для незрячих или частично незрячих, использующих для просмотра сайта скринридер.

Основные семантические тэги: <article>, <section>, <aside>, <nav>, <header>, <main>, <footer>.*/

//CSS (Cascading Style Sheets) — это код, который используется для стилизации веб-страницы.

/*Вес селекторов CSS по убыванию:

- стили, заданные в атрибуте style
- cелекторы по идентификатору (#id)
- cелекторы по классу (.class)
- селекторы по атрибуту и селекторы с псевдоклассами
- селекторы по тегу
- селекторы с псевдоэлементами*/

/*Каждый из блоков (box model), занимающий пространство на странице имеет такие свойства, как:

- padding, пространство только вокруг контента
- border, сплошная линия, которая расположена рядом с padding
- margin, пространство вокруг внешней стороны элемента
*/

//Блочные элементы: div, section, nav, header, footer, main, aside, article, p

//Строчные элементы: b, strong, i, em, u, a, span, mark, del, ins, s, small

/*Значения свойства display:

- значения, которые задают тип элементу и влияют на поток элемента в документа: block, inline
- значения, которые определяют как будут располагаться дочерние элементы блока: table, flex, grid
- значения, которые задают тип элемента и работают только если являются дочерними элементами с определенным типом: table-column, table-caption, table-cell, table-row

Другие значения: none, inline-block, inline-flex, inline-grid, list-item*/

//Псевдокласс в CSS — это ключевое слово, добавленное к селектору, которое определяет его особое состояние (:hover, :visited, :checked, :active, :focus).

//Псевдоэлемент в CSS — это ключевое слово, добавляемое к селектору, которое позволяет стилизовать определённую часть выбранного элемента (::after, ::before, ::first-letter).

/*Преимущества препроцессора SASS: переменные, вложенности, фрагментирование, импорт, миксины, расширение/наследование, математические операторы, функции*/
